// Search for reconnaissance in AD
let TimeRange = 1d;
AlertInfo
| where Timestamp > ago(TimeRange)
| where DetectionSource == "Microsoft Defender for Identity"
| join (AlertEvidence
| where Timestamp > ago(TimeRange)
| where EntityType == "Machine" 
    and EvidenceDirection == "Source" 
    and ServiceSource == "Microsoft Defender for Identity" 
) on AlertId
| summarize by Timestamp,DeviceName, AttackTechniques, Category, Severity, EvidenceRole
