// NTLMV1 Tracking
IdentityLogonEvents
| where Timestamp > ago (30d)
| where Application == "Active Directory"
| where Protocol == "Ntlm"
| extend AddData = todynamic(AdditionalFields)
| extend NTLMV1 = tostring(AddData.IsNtlmV1)
| extend Account = tostring((AddData).["ACTOR.ACCOUNT"])
| where NTLMV1 == "True"
