// Search for Enum in AD
let MalActions = pack_array('SAMR','LDAP');
IdentityQueryEvents
| where Application == @"Active Directory"
| where ActionType has_any (MalActions)
| project Timestamp,DeviceName,DestinationDeviceName,AccountDisplayName, ActionType, QueryType, QueryTarget
