// Unknown User with failed logon from unknown device
IdentityLogonEvents
| where Timestamp > ago(3h)
| where LogonType == "Failed logon"
| where FailureReason == "UnknownUser"
| extend TO_DEVICE = tostring(AdditionalFields.["TO.DEVICE"])

--------------------------------

IdentityLogonEvents 
| where Timestamp > ago(3h)
| where ActionType == "LogonFailed"
| where FailureReason == "UnknownUser"
| where AccountName !endswith "$"
