// Unknown User with failed logon from unknown device

IdentityLogonEvents
| where Timestamp > ago(1h)
| where LogonType == "Failed logon"
| where FailureReason == "UnknownUser" 
| where ActionType == "LogonFailed"
| where AccountName !endswith "$"
| extend TO_DEVICE = tostring(AdditionalFields.["TO.DEVICE"])
| summarize count() by DeviceName, ActionType, LogonType, FailureReason, Protocol, AccountName, DestinationDeviceName
