// General search for NetworkSignatureInspected  
DeviceNetworkEvents 
| where ActionType == "NetworkSignatureInspected"
| where Timestamp > ago(1d)
| extend SigName = parse_json(AdditionalFields).SignatureName,
    SigMatchedContent = parse_json(AdditionalFields).SignatureMatchedContent,
    SigSampleContent = parse_json(AdditionalFields).SignatureSampleContent
| distinct tostring(SigName)
